alibaba/AliOS-Things/platform/mcu/rtl8710bn/sdk/component/soc/realtek/8711b/fwlib/include/rtl8710b_pmc.h
/**
  ******************************************************************************
  * @file    rtl8710b_pmc.h
  * @author
  * @version V1.0.0
  * @date    2016-05-17
  * @brief   This file provides firmware functions to manage the following 
  *          functionalities of the soc power management circut:
  *           - wakeup timer
  *           - wakeup pin
  *           - sleep option
  *           - sleep mode
  ******************************************************************************
  * @attention
  *
  * This module is a confidential and proprietary property of RealTek and
  * possession or use of this module requires written permission of RealTek.
  *
  * Copyright(c) 2015, Realtek Semiconductor Corporation. All rights reserved.
  ****************************************************************************** 
  */

#ifndef _RTL8710B_PMC_H_
#define _RTL8710B_PMC_H_

/** @addtogroup AmebaZ_Platform
  * @{
  */

/** @defgroup PMC
  * @brief PMC driver modules
  * @{
  */

/** @addtogroup PMC
  * @verbatim
  *****************************************************************************************
  * Introduction
  *****************************************************************************************
  * we support  following soc power save functions:
  *		- sleep clock gating
  *		- sleep power gating
  *		- deep standby
  *		- deep sleep
  *
  *****************************************************************************************
  * sleep power gating
  *****************************************************************************************
  * following functions can be used when power gating:
  *		-UART0/UART1
  *		-TIM4/TIM5
  *		-RTC
  *		-WIFI
  *		-SDIO
  *		-USB   
  *		-I2C0/I2C1    
  *		-ADC  
  *		-GPIO
  *		-REGU timer
  *		-normal wakepin
  *		-ANA timer
  * following functions will be closed when power gating:
  *		-UART2 LOGUART
  *		-TIM0-TIM3
  *		-SPIC flash
  *
  *****************************************************************************************
  * deep standby
  *****************************************************************************************
  * following functions can be used when deep standby:
  *		-RTC
  *		-REGU timer
  *		-normal wakepin 
  *		-ANA timer
  *
  *****************************************************************************************
  * deep sleep
  *****************************************************************************************
  * following functions can be used when deep standby:
  *		-REGU timer
  *		-REGU wakepin 
  *
  *****************************************************************************************
  * wakepin (A18/A5/A22/A23: mux normal wakepin and REGU wakepin)
  *****************************************************************************************
  * normal wakepin:
  *		-SLP_CG
  *		-SLP_PG
  *		-STDBY
  * REGU wakepin:
  *		-just used in DSLP (1.2V closed)
  *		-just support high acive, so this pin should pull low on your board 
  *
  *****************************************************************************************
  *****************************************************************************************
  * SLP & SNZ power option
  *****************************************************************************************
  * BIT_SYSON_PMOPT_SLP_EN_SWR & BIT_SYSON_PMOPT_SNZ_EN_SWR
  *		-we have two 1.2V LDO
  *			-BIG LDO: SWR mode or LDO mode (can config )
  *			-LITTLE LDO: a little 1.2v LDO
  *		-BIT_SYSON_PMOPT_SLP_EN_SWR
  *			-ENABLE/DISABLE BIG LDO when SLP
  *		BIT_SYSON_PMOPT_SNZ_EN_SWR
  *			-ENABLE/DISABLE BIG LDO when SNZ, WIFI & ADC need open BIG LDO when SNZ
  *
  * BIT_SYSON_PMOPT_SLP_EN_PWM & BIT_SYSON_PMOPT_SNZ_EN_PWM
  *		-BIT_SYSON_PMOPT_SLP_EN_PWM
  *			-ENABLE/DISABLE LDO heavy loading current mode when SLP
  *		-BIT_SYSON_PMOPT_SNZ_EN_PWM
  *			-ENABLE/DISABLE heavy loading current mode when SNZ, WIFI & ADC need heavy loading when SNZ
  *
  * BIT_SYSON_PMOPT_SLP_XTAL_EN & BIT_SYSON_PMOPT_SNZ_XTAL_EN
  *		-WIFI and SOC both need XTAL when work, 
  *		-but WIFI have individual option to control XTAL, so BIT_SYSON_PMOPT_SNZ_XTAL_EN not needed
  *
  * BIT_SYSON_PMOPT_SLP_SYSPLL_EN & BIT_SYSON_PMOPT_SNZ_SYSPLL_EN
  *		-WIFI and SOC both have individual PLL, here is SOC 500M PLL
  *		-So BIT_SYSON_PMOPT_SNZ_SYSPLL_EN not needed
  *
  * BIT_SYSON_SNFEVT_WIFI_MSK = 1 & BIT_SYSON_BYPASS_SNZ_SLP = 1
  *		- after OS suspend, platform will enter SNZ and close CPU, then platform enter sleep mode when WIFI 32K
  *		- BIT_SYSON_PMOPT_SNZ_EN_SOC should never open, or CPU will not close when platform will enter SNZ
  *
  * BIT_SYSON_SNFEVT_WIFI_MSK = 1 & BIT_SYSON_BYPASS_SNZ_SLP = 0 (not use this config)
  *		- after OS suspend, platform will enter sleep mode & close CPU after WIFI 32K
  *****************************************************************************************
  * @endverbatim
  */


/* Exported constants --------------------------------------------------------*/

/** @defgroup PMC_Exported_Constants PMC Exported Constants
  * @{
  */ 

/** @defgroup PMC_WakePin_definitions 
  * @{
  */ 
#define	WAKEUP_BY_GPIO_NONE				((u32)(0x00000000))
#define	WAKEUP_BY_GPIO_WAKEUP0_LOW	((u32)(0x00000001))		//PA18
#define	WAKEUP_BY_GPIO_WAKEUP0_HIG		((u32)(0x00000101))
#define	WAKEUP_BY_GPIO_WAKEUP1_LOW	((u32)(0x00000001 << 1))	//PA5
#define	WAKEUP_BY_GPIO_WAKEUP1_HIG		((u32)(0x00000101 << 1))
#define	WAKEUP_BY_GPIO_WAKEUP2_LOW	((u32)(0x00000001 << 2))	//PA22
#define	WAKEUP_BY_GPIO_WAKEUP2_HIG		((u32)(0x00000101 << 2))
#define	WAKEUP_BY_GPIO_WAKEUP3_LOW	((u32)(0x00000001 << 3))	//PA23
#define	WAKEUP_BY_GPIO_WAKEUP3_HIG		((u32)(0x00000101 << 3))
/**
  * @}
  */


/** @defgroup SOCPS_PS_Mode_definitions 
  * @{
  */ 
#define	SOCPS_MODE_DSLP					((u32)(0x00000001 << 0))
#define	SOCPS_MODE_DSTBY					((u32)(0x00000001 << 1))
#define	SOCPS_MODE_SLP					((u32)(0x00000001 << 2))
/**
  * @}
  */

/** @defgroup SOCPS_PS_ANA_Clk_definitions 
  * @{
  */
#define	ANACK_250K							((u32)0x00000000)
#define	ANACK_4M							((u32)0x00000001)
/**
  * @}
  */

/** @defgroup SOCPS_PS_Calibration_Clk_definitions 
  * @{
  */
#define	ANACK								((u32)0x00000000)
#define	A33CK								((u32)0x00000001)
/**
  * @}
  */

