alibaba/AliOS-Things/platform/mcu/rtl8710bn/sdk/component/soc/realtek/8711b/fwlib/include/rtl8710b_pmc.h
/** @defgroup SOCPS_PS_Wakeup_Pin_definitions 
  * @{
  */
#define	WAKUP_0							((u32)0x00000000)/*!< _PA_18 */
#define	WAKUP_1							((u32)0x00000001)/*!< _PA_5 */
#define	WAKUP_2							((u32)0x00000002)/*!< _PA_22 */
#define	WAKUP_3							((u32)0x00000003)/*!< _PA_23 */
/**
  * @}
  */

/** @defgroup SOCPS_PS_Wakeup_Pin_Mask_definitions 
  * @{
  */
#define	WAKUP_0_MASK						((u32)(0x00000001 << 0))/*!< _PA_18 */
#define	WAKUP_1_MASK						((u32)(0x00000001 << 1))/*!< _PA_5 */
#define	WAKUP_2_MASK						((u32)(0x00000001 << 2))/*!< _PA_22 */
#define	WAKUP_3_MASK						((u32)(0x00000001 << 3))/*!< _PA_23 */
#define	IS_WAKEPIN_MASK(MASK)			(((MASK) & 0x0000000F) != 0)
/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup PMC_Exported_Functions PMC Exported Functions
  * @{
  */
_LONG_CALL_ void SOCPS_BackupCPUClk(void);
_LONG_CALL_ void SOCPS_RestoreCPUClk(void);

_LONG_CALL_ void SOCPS_BootFromPS(u32 NewStatus);
_LONG_CALL_ void SOCPS_TrapPin(u32 NewStatus);
_LONG_CALL_ void SOCPS_ANACKSel(u32 ANACLK);
_LONG_CALL_ void SOCPS_SetWakeEvent(u32 Option, u32 NewStatus);
_LONG_CALL_ void SOCPS_ClearWakeEvent(void);
_LONG_CALL_ void SOCPS_WakePinsCtrl(u32 GpioOption);
_LONG_CALL_ void SOCPS_WakePinCtrl(u32 Index, u32 Polarity);
_LONG_CALL_ void SOCPS_SetANATimer(u32 SDuration, u32 NewStatus);
_LONG_CALL_ void SOCPS_SetReguWakepin(void);
_LONG_CALL_ void SOCPS_SetReguTimer(u32 SDuration, u32 CalibData);
_LONG_CALL_ void SOCPS_PWRMode(u32 pwrmode, u32 snz_bypss);
_LONG_CALL_ void SOCPS_PWROption(u32 pwrmgt_option);
_LONG_CALL_ void SOCPS_PWROptionExt(u32 pwrmgt_option);
_LONG_CALL_ void SOCPS_SNZMode(u32 SnzMask, u32 NewStatus);

_LONG_CALL_ u32 SOCPS_CLKCal(u32 ClkSel);

_LONG_CALL_ void SOCPS_DeepStandby(void);
_LONG_CALL_ void SOCPS_DeepSleep(void);
_LONG_CALL_ void SOCPS_SleepPG(void);
_LONG_CALL_ void SOCPS_SetReguWakepins(u32 PinMask);
_LONG_CALL_ void SOCPS_ReguTimerCmd(u32 NewStatus);
_LONG_CALL_ void SOCPS_WakePinDebounce(u32 Index, u32 Status);

_LONG_CALL_ void SOCPS_DeepStandby_RAM(void);
_LONG_CALL_ void SOCPS_SleepPG_RAM(void);
_LONG_CALL_ void SOCPS_DeepSleep_RAM(void);
_LONG_CALL_ void SOCPS_FlashPin_PullUp_RAM(u32 NewStatus);
void SOCPS_SetReguWakepins_RAM(u32 PinMask);
void SOCPS_ReguTimerCmd_RAM(u32 NewStatus);
void SOCPS_WakePinDebounce_RAM(u32 Index, u32 Status);
void SOCPS_SetReguTimer_RAM(u32 SDuration, u32 CalibData);
void SOCPS_SleepCG(void);
int SOCPS_DsleepWakeReason(void);
/**
  * @}
  */


/* Registers Definitions --------------------------------------------------------*/
/**************************************************************************//**
 * @defgroup PMC_Register_Definitions PMC Register Definitions
 * @{
 *****************************************************************************/
 
/**************************************************************************//**
 * @defgroup REG_SYS_ANA_TIM_CTRL
 * @{
 *****************************************************************************/
#define BIT_SYS_ANACK_TU_TIME(x)				(((x) & 0x0000003f) << 16)
#define BIT_SYS_DSBYCNT_EN						(0x00000001 << 15)
#define BIT_SYS_DSTDY_TIM_SCAL(x)				(((x) & 0x0000000f) << 8)
#define BIT_SYS_DSTBY_TIM_PERIOD(x)			(((x) & 0x000000ff) << 0)
/** @} */

/**************************************************************************//**
 * @defgroup REG_SYS_DSLP_TIM_CTRL
 * @{
 *****************************************************************************/
#define BIT_SYS_REGU_ASIF_EN(x)				(((x) & 0x000000ff) << 24)
#define BIT_SYS_REGU_ASIF_THP_DA(x)			(((x) & 0x00000003) << 20)
#define BIT_SYS_REGU_ASIF_TPD_CK(x)			(((x) & 0x00000003) << 18)
#define BIT_SYS_REGU_ASIF_TSP_DA(x)			(((x) & 0x3) << 16)
#define BIT_SYS_REGU_ASIF_POLL					(0x00000001 << 15)
#define BIT_SYS_REGU_ASIF_MODE				(0x00000001 << 14)
#define BIT_SYS_REGU_ASIF_WE					(0x00000001 << 12)
#define BIT_SYS_REGU_ASIF_AD(x)				(((x) & 0x0000000f) << 8)
#define BIT_SYS_REGU_ASIF_WD(x)				(((x) & 0x000000ff) << 0)
/** @} */

/**************************************************************************//**
 * @defgroup REG_SYS_DSLP_TIM_CAL_CTRL
 * @{
 *****************************************************************************/
#define BIT_SYS_DSLP_TIM_EN					(0x00000001 << 24)
#define BIT_SYS_DSLP_TIM_PERIOD(x)				(((x) & 0x7fffff) << 0)
/** @} */

/**************************************************************************//**
 * @defgroup REG_SYS_GPIO_DSTBY_WAKE_CTRL0
 * @{
 *****************************************************************************/
#define BIT_SYS_WAKEPIN3_WEVENT_STS			(0x00000001 << 27)
#define BIT_SYS_WAKEPIN2_WEVENT_STS			(0x00000001 << 26)
#define BIT_SYS_WAKEPIN1_WEVENT_STS			(0x00000001 << 25)
#define BIT_SYS_WAKEPIN0_WEVENT_STS			(0x00000001 << 24)
#define BIT_SYS_WAKEPIN3_PULL_CTRL_EN		(0x00000001 << 19)
#define BIT_SYS_WAKEPIN2_PULL_CTRL_EN		(0x00000001 << 18)
#define BIT_SYS_WAKEPIN1_PULL_CTRL_EN		(0x00000001 << 17)
#define BIT_SYS_WAKEPIN0_PULL_CTRL_EN		(0x00000001 << 16)
#define BIT_SYS_WAKEPIN3_WINT_MODE			(0x00000001 << 11)
#define BIT_SYS_WAKEPIN2_WINT_MODE			(0x00000001 << 10)
#define BIT_SYS_WAKEPIN1_WINT_MODE			(0x00000001 << 9)
#define BIT_SYS_WAKEPIN0_WINT_MODE			(0x00000001 << 8)
#define BIT_SYS_WAKEPIN3_PIN_EN				(0x00000001 << 3)
#define BIT_SYS_WAKEPIN2_PIN_EN				(0x00000001 << 2)
#define BIT_SYS_WAKEPIN1_PIN_EN				(0x00000001 << 1)
#define BIT_SYS_WAKEPIN0_PIN_EN				(0x00000001 << 0)

#define MARSK_WAKEPIN0_HIGH_WAKE	(BIT_SYS_WAKEPIN0_PIN_EN | \
										BIT_SYS_WAKEPIN0_WINT_MODE | \
										BIT_SYS_WAKEPIN0_PULL_CTRL_EN | \
										BIT_SYS_WAKEPIN0_WEVENT_STS)

#define MARSK_WAKEPIN0_LOW_WAKE		(BIT_SYS_WAKEPIN0_PIN_EN | \
										BIT_SYS_WAKEPIN0_PULL_CTRL_EN | \
										BIT_SYS_WAKEPIN0_WEVENT_STS)
/** @} */

/**************************************************************************//**
 * @defgroup REG_SYS_GPIO_DSTBY_WAKE_CTRL1
 * @{
 *****************************************************************************/										
#define BIT_SYS_BTCLKDET_MODE					(0x00000001 << 27)
#define BIT_SYS_BTCLKDET_DEBOUNCE_EN			(0x00000001 << 26)
#define BIT_SYS_BTCLKDET_TIM_SCAL				(0x00000003 << 24)

#define BIT_SYS_WAKEPIN3_SHTDN_N				(0x00000001 << 19)
#define BIT_SYS_WAKEPIN2_SHTDN_N				(0x00000001 << 18)
#define BIT_SYS_WAKEPIN1_SHTDN_N				(0x00000001 << 17)
#define BIT_SYS_WAKEPIN0_SHTDN_N				(0x00000001 << 16)
#define BIT_SYS_WINT_DEBOUNCE_TIM_SCAL(x)	(((x) & 0x3) << 8)

#define BIT_SYS_WAKEPIN3_WINT_DEBOUNCE_EN	(0x00000001 << 3)
#define BIT_SYS_WAKEPIN2_WINT_DEBOUNCE_EN	(0x00000001 << 2)
#define BIT_SYS_WAKEPIN1_WINT_DEBOUNCE_EN	(0x00000001 << 1)
#define BIT_SYS_WAKEPIN0_WINT_DEBOUNCE_EN	(0x00000001 << 0)
/** @} */

/**************************************************************************//**
 * @defgroup REG_SYS_SLP_WAKE_EVENT_MSK0
 * @{
 *****************************************************************************/	
#define BIT_SYSON_WEVT_BOR2_MSK				(0x00000001 << 30)	/*!< BOR2 wakeup */

#define BIT_SYSON_WEVT_GPIO_DSTBY_MSK		(0x00000001 << 29)	/*!< 1: enable Wakepin Wakeup DSTBY event */
#define BIT_SYSON_WEVT_A33_AND_A33GPIO_MSK	(0x00000001 << 28)	/*!< 1: enable REGU A33(deepsleep mode, A33 Timer & A33 wakepin) Wakeup event */
#define BIT_SYSON_WEVT_ADC_MSK				(0x00000001 << 26)	/*!< 1: enable  ADC Wakeup  event */

#define BIT_SYSON_WEVT_SDIO_MSK				(0x00000001 << 14)	/*!< 1: enable  SDIO Wakeup  event */
#define BIT_SYSON_WEVT_RTC_MSK				(0x00000001 << 13)	/*!< 1: enable RTC Wakeup  event */
#define BIT_SYSON_WEVT_UART1_MSK				(0x00000001 << 12)	/*!< 1: enable UART1  Wakeup  event */
#define BIT_SYSON_WEVT_UART0_MSK				(0x00000001 << 11)	/*!< 1: enable UART0  Wakeup  event */
#define BIT_SYSON_WEVT_I2C1_MSK				(0x00000001 << 10)	/*!< 1: enable I2C1  Wakeup  event */
#define BIT_SYSON_WEVT_I2C0_MSK				(0x00000001 << 9)	/*!< 1: enable I2C0  Wakeup  event */

#define BIT_SYSON_WEVT_WLAN_MSK				(0x00000001 << 8)	/*!< 1: enable  WLAN Wakeup  event */

