alibaba/AliOS-Things/platform/mcu/rtl8710bn/sdk/component/soc/realtek/8711b/fwlib/include/rtl8710b_pmc.h
#define BIT_SYSON_WEVT_I2C1_ADDRMATCH_MSK	(0x00000001 << 7)	/*!< 1:enable wakeup event of I2C1 RX address match */
#define BIT_SYSON_WEVT_I2C0_ADDRMATCH_MSK	(0x00000001 << 6)	/*!< 1:enable wakeup event of I2C0 RX address match */

#define BIT_SYSON_WEVT_USB_MSK				(0x00000001 << 5)	/*!< 1: enable wakeup event of usb resume from suspend mode  */
#define BIT_SYSON_WEVT_GPIO_MSK				(0x00000001 << 4)	/*!< 1: enable GPIO  Wakeup  event */
#define BIT_SYSON_WEVT_CHIP_EN_MSK			(0x00000001 << 3)	/*!< 1: enable chip en wakeup  event */
#define BIT_SYSON_WEVT_OVER_CURRENT_MSK		(0x00000001 << 2)	/*!< 1: enable OCP wakeup  event, REGU OVER_CURRENT */
#define BIT_SYSON_WEVT_GTIM_MSK				(0x00000001 << 1)	/*!< 1: enable Gtimer 4/5 Wakeup SYSON event */
#define BIT_SYSON_WEVT_SYSTIM_MSK			(0x00000001 << 0)	/*!< 1: enable SYS Timer(ANA Timer, deepstandby mode) Wakeup SYSON event */
/** @} */

/**************************************************************************//**
 * @defgroup REG_SYS_SLP_WAKE_EVENT_STATUS0
 * @{
 *****************************************************************************/
#define BIT_SYSON_WEVT_BOR2_STS				(0x00000001 << 30)

#define BIT_SYSON_WEVT_GPIO_DSTBY_STS		(0x00000001 << 29)
#define BIT_SYSON_WEVT_A33_STS				(0x00000001 << 28)
#define BIT_SYSON_WEVT_ADC_STS				(0x00000001 << 26)

#define BIT_SYSON_WEVT_SDIO_STS				(0x00000001 << 14)
#define BIT_SYSON_WEVT_RTC_STS				(0x00000001 << 13)
#define BIT_SYSON_WEVT_UART1_STS				(0x00000001 << 12)
#define BIT_SYSON_WEVT_UART0_STS				(0x00000001 << 11)
#define BIT_SYSON_WEVT_I2C1_STS				(0x00000001 << 10)
#define BIT_SYSON_WEVT_I2C0_STS				(0x00000001 << 9)

#define BIT_SYSON_WEVT_WLAN_STS				(0x00000001 << 8)

#define BIT_SYSON_WEVT_I2C1_ADDRMATCH_STS	(0x00000001 << 7)
#define BIT_SYSON_WEVT_I2C0_ADDRMATCH_STS	(0x00000001 << 6)

#define BIT_SYSON_WEVT_USB_STS				(0x00000001 << 5)
#define BIT_SYSON_WEVT_GPIO_STS				(0x00000001 << 4)
#define BIT_SYSON_WEVT_CHIP_EN_STS			(0x00000001 << 3)
#define BIT_SYSON_WEVT_OVER_CURRENT_STS		(0x00000001 << 2)
#define BIT_SYSON_WEVT_GTIM_STS				(0x00000001 << 1)
#define BIT_SYSON_WEVT_SYSTIM_STS			(0x00000001 << 0)
/** @} */

/**************************************************************************//**
 * @defgroup REG_SYS_SNF_WAKE_EVENT_MSK0
 * @{
 *****************************************************************************/
#define BIT_SYSON_SNFEVT_WIFI_MSK				(0x00000001 << 1) /*!< 1: enable wlan power on wakeup event interrupt; 0: Disable */
#define BIT_SYSON_SNFEVT_ADC_MSK				(0x00000001 << 0) /*!< 1: enable ADC  Wakeup SYSON event from GTIM3 interrupt under oneshot mode ; 0: disable the event to wakeup system */
/** @} */

/**************************************************************************//**
 * @defgroup REG_SYS_SNF_WAKE_EVENT_STATUS
 * @{
 *****************************************************************************/
#define BIT_SYSON_SNFEVT_WIFI_STS				(0x00000001 << 1) /*!< 1: indicate wlan power on wakeup status */
#define BIT_SYSON_SNFEVT_ADC_STS				(0x00000001 << 0) /*!< 1: indicate ADC wakeup  event  status */
/** @} */

/**************************************************************************//**
 * @defgroup REG_SYS_PWRMGT_CTRL
 * @{
 *****************************************************************************/
#define BIT_SYSON_PMCOPT_BKPOFIMK2			(0x00000001 << 18) /*!< Enable wakeup interrupt to break power off flow during power off stage2 */
#define BIT_SYSON_PMCOPT_BKPOFIMK1			(0x00000001 << 17) /*!< Enable wakeup interrupt to break power off flow during power off stage1 */
#define BIT_SYSON_PMCOPT_BKPOFIMK0			(0x00000001 << 16) /*!< Enable wakeup interrupt to break power off flow during power off stage0 */


#define BIT_SYSON_BYPASS_SNZ_SLP				(0x00000001 << 8) /*!< If WIFI WOWLAN open we should open it, or SOC will sleep when WIFI active */
#define BIT_SYSON_PM_CMD_SLP					(0x00000001 << 2) /*!< 1: command SYSON SM to enter sleep state, when PMC finishes the process, this bit will be auto clear to 0 */
#define BIT_SYSON_PM_CMD_DSTBY				(0x00000001 << 1) /*!< 1: command SYSON SM to enter deep standby state,when PMC finishes the process, this bit will be auto clear to 0 */
#define BIT_SYSON_PM_CMD_DSLP					(0x00000001 << 0) /*!< 1: command SYSON SM to enter deep sleep state,when PMC finishes the process, this bit will be auto clear to 0 */
/** @} */

/**************************************************************************//**
 * @defgroup REG_SYS_PWRMGT_OPTION
 * @{
 *****************************************************************************/
#define BIT_SYSON_PMOPT_NORM_SYSCLK_SEL		(0x00000001 << 30) /*!< 1: select system PLL clock as CPU clock when enter into active mode; 0: select ANA clock */
#define BIT_SYSON_PMOPT_NORM_SYSPLL_EN		(0x00000001 << 29) /*!< 1: enable syspem PLL when enter into active mode; 0: disable SYSPLL */
#define BIT_SYSON_PMOPT_NORM_XTAL_EN		(0x00000001 << 28) /*!< 1: enable XTAL when enter into active mode; 0: disable XTAL */
#define BIT_SYSON_PMOPT_NORM_EN_PWM			(0x00000001 << 26) /*!< 1: power enable SWR/LDO output heavy loading current mode when enter into power mode */

#define BIT_SYSON_PMOPT_SNZ_MEM2_EN			(0x00000001 << 24) /*!< 1: enable MEM2 when enter into snooze mode */
#define BIT_SYSON_PMOPT_SNZ_MEM1_EN			(0x00000001 << 23) /*!< 1: enable MEM1 when enter into snooze mode */
#define BIT_SYSON_PMOPT_SNZ_MEM0_EN			(0x00000001 << 22) /*!< 1: enable MEM0 when enter into snooze mode */
#define BIT_SYSON_PMOPT_SNZ_SYSPLL_EN		(0x00000001 << 21) /*!< 1: enable syspem PLL when enter into snooze mode, wifi not use, adc use */
#define BIT_SYSON_PMOPT_SNZ_XTAL_EN			(0x00000001 << 20) /*!< 1: enable XTAL when enter into snooze mode, wifi not use, adc use */
#define BIT_SYSON_PMOPT_SNZ_EN_SOC			(0x00000001 << 19) /*!< 1: power enable SOC platform when enter into snooze mode */
#define BIT_SYSON_PMOPT_SNZ_EN_PWM			(0x00000001 << 18) /*!< 1: power enable SWR/LDO output heavy loading current mode when enter into snooze mode, wifi use it when close BIT_SYSON_PMOPT_SLP_EN_PWM*/
#define BIT_SYSON_PMOPT_SNZ_EN_SWR			(0x00000001 << 17) /*!< 1: power enable SWR/LDO 1.2V when enter into snooze mode, wifi use it when close BIT_SYSON_PMOPT_SLP_EN_SWR*/

#define BIT_SYSON_PMOPT_SLP_MEM2_EN			(0x00000001 << 16) /*!< 1: enable MEM2 when enter into sleep mode, 64k */
#define BIT_SYSON_PMOPT_SLP_MEM1_EN			(0x00000001 << 15) /*!< 1: enable MEM1 when enter into sleep mode, 64k */
#define BIT_SYSON_PMOPT_SLP_MEM0_EN			(0x00000001 << 14) /*!< 1: enable MEM0 when enter into sleep mode, 128k */
#define BIT_SYSON_PMOPT_SLP_SYSPLL_EN		(0x00000001 << 13) /*!< 1: enable syspem PLL when enter into sleep mode; 0: disable SYSPLL */
#define BIT_SYSON_PMOPT_SLP_XTAL_EN			(0x00000001 << 12) /*!< 1: enable XTAL when enter into sleep mode; 0: disable XTAL */
#define BIT_SYSON_PMOPT_SLP_EN_SOC			(0x00000001 << 11) /*!< 1: power enable SOC platform when enter into sleep mode; 0: power off SoC domain */
#define BIT_SYSON_PMOPT_SLP_EN_PWM			(0x00000001 << 10) /*!< 1: power enable SWR/LDO output heavy loading current mode when enter into sleep mode, wifi on can not */
#define BIT_SYSON_PMOPT_SLP_EN_SWR			(0x00000001 << 9) /*!< 1: power enable BIG 1.2V LDO (SWR/LDO can cfg)  when enter into sleep mode, just keep little LDO; wifi on can not */
#define BIT_SYSON_PMOPT_SLP_LPLDO_SEL		(0x00000001 << 8) /*!< V12H LDO operation mode selection for sleep, 1: normal, 0: standby(low current mode), always-on power is here */

