alibaba/AliOS-Things/platform/mcu/rtl8710bn/sdk/component/soc/realtek/8711b/fwlib/include/rtl8710b_pmc.h
#define BIT_SYSON_PMOPT_DSTBY_LPLDO_SEL		(0x00000001 << 0) /*!< V12H LDO operation mode selection for deep standby, 1: normal, 0: standby */

/* 0x74000100 */
#define BIT_SYSON_PMOPT_MASK		(BIT_SYSON_PMOPT_NORM_EN_PWM | \
									BIT_SYSON_PMOPT_NORM_XTAL_EN | \
									BIT_SYSON_PMOPT_NORM_SYSPLL_EN | \
									BIT_SYSON_PMOPT_NORM_SYSCLK_SEL | \
									BIT_SYSON_PMOPT_SNZ_EN_SWR | \
									BIT_SYSON_PMOPT_SNZ_EN_PWM | \
									BIT_SYSON_PMOPT_SNZ_MEM0_EN | \
									BIT_SYSON_PMOPT_SNZ_MEM1_EN | \
									BIT_SYSON_PMOPT_SNZ_MEM2_EN)
/** @} */

/**************************************************************************//**
 * @defgroup REG_SYS_PWRMGT_OPTION_EXT
 * @{
 *****************************************************************************/									
#define BIT_SYSON_PMOPT_SLP_BYPS_WL			(0x00000001 << 4) /*!< 1: CM4 can enter sleep mode with no  regard of wlan's power state */
#define BIT_SYSON_PMOPT_SLP_REDUCE_VOL		(0x00000001 << 3) /*!< 1: decrease SWR/LDO 1.2V voltage level when enter into sleep mode(decrease digital power); */
#define BIT_SYSON_PMOPT_SLP_ANACK_SEL		(0x00000001 << 2) /*!< 1: set ANA clock to 4MHz when enter into power mode; */
#define BIT_SYSON_PMOPT_SLP_ANACK_EN			(0x00000001 << 1) /*!< 1: enable syson register clock when enter into sleep mode; */
#define BIT_SYSON_PMOPT_SLP_SWR_ADJ			(0x00000001 << 0) /*!< 1: decrease VD12H 1.2V voltage level when enter into sleep mode(decrease always on power, should better not use); */
/** @} */

/**************************************************************************//**
 * @defgroup REG_SYS_DSLP_WEVENT
 * @{
 *****************************************************************************/	
#define BIT_SYSON_DSLP_GPIO					(0x00000001 << 2) /*!< REGU GPIO wake33 event */
#define BIT_SYSON_DSLP_WTIMER33				(0x00000001 << 0) /*!< REGU Timer33 wake event */
/** @} */
/** @} */

/**
  * @}
  */

/**
  * @}
  */

/* Other Definitions --------------------------------------------------------*/
#define REG_VDR_ANACK_CAL_CTRL 0xA0
#define NVIC_ICPR0_PS_MASK 0xFFFFFFFF

#ifdef CONFIG_CHIP_A_CUT
#define SOCPS_SET_REGUTIMER		SOCPS_SetReguTimer_RAM
#else
#define SOCPS_SET_REGUTIMER		SOCPS_SetReguTimer
#endif


#endif //_RTL8710B_PMC_H_
/******************* (C) COPYRIGHT 2016 Realtek Semiconductor *****END OF FILE****/
